app/Controllers/Car.php

SELECT *
FROM `cars`
---
    public function index()
    {
        $cars = $this->carModel->findAll();

INSERT INTO `cars` (`name`, `brand`, `type`, `price`, `manufacture`) VALUES ('sadsad', 'dsasad', 'Manual', '567657657', '2025-01-01')
---
    public function save()
    {
        // list data yang ditambahkan
        $this->carModel->save([
            'name' => $this->request->getPost('name'),
            'brand' => $this->request->getPost('brand'),
            'type' => $this->request->getPost('type'),
            'price' => $this->request->getPost('price'),
            'manufacture' => $this->request->getPost('manufacture'),
        ]);

SELECT *
FROM `cars`
WHERE `cars`.`id` = '12'
---
    public function edit($id)
    {
        // menemukan id car
        $car = $this->carModel->find($id);

UPDATE `cars` SET `name` = 'Honda Brio', `brand` = 'Honda', `type` = 'Manual', `price` = '56546000', `manufacture` = '2025-01-01'
WHERE `cars`.`id` IN ('12')
---
    public function update($id)
    {
        // menampung data yang diubah
        $data = [
            'name' => $this->request->getPost('name'),
            'brand' => $this->request->getPost('brand'),
            'type' => $this->request->getPost('type'),
            'price' => $this->request->getPost('price'),
            'manufacture' => $this->request->getPost('manufacture'),
        ];

        // melakukan updated data
        $this->carModel->update($id, $data);

DELETE FROM `cars`
WHERE `id` IN ('12')
---
    public function delete($id)
    {
        $this->carModel->delete($id);